//=============================================================================
//
//	デバッグ表示処理 [debugproc.cpp]
//	Author : SHUMA AIZU
// 
//=============================================================================

//*****************************************************************************
// インクルードヘッダー
//*****************************************************************************
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "debugproc.h"
#include "input.h"

//=============================================================================
// 静的メンバ変数
//=============================================================================
LPD3DXFONT CDebugProc::m_pFont = NULL;					// フォントへのポインタ
char CDebugProc::m_aStrDebug[MAX_TEXT] = {};			// 文字列(デバッグ情報)を格納するバッファ

//=============================================================================
// コンストラクタ
//=============================================================================
CDebugProc::CDebugProc()
{
	// 各変数のクリア
	m_pFont = NULL;
	memset(&m_aStrDebug[0], 0, sizeof m_aStrDebug);
}

//=============================================================================
// デストラクタ
//=============================================================================
CDebugProc::~CDebugProc()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CDebugProc::Init(void)
{
	// デバイスの取得
	CManager* pManager = CManager::GetInstance();
	CRenderer* pRenderer = pManager->GetRenderer();
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();

	// デバッグ表示用フォントの生成
	D3DXCreateFont(pDevice, 24, 0, 0, 0, FALSE, SHIFTJIS_CHARSET,
		OUT_DEFAULT_PRECIS, DEFAULT_QUALITY, DEFAULT_PITCH,
		"PixelMplus12", &m_pFont);

	if (m_pFont == NULL)
	{// フォントの生成に失敗した
		return E_FAIL;
	}

	// デバッグ情報バッファのクリア
	memset(&m_aStrDebug[0], 0, sizeof m_aStrDebug);

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CDebugProc::Uninit(void)
{
	// デバッグ表示用フォントの破棄
	if (m_pFont != NULL)
	{
		m_pFont->Release();
		m_pFont = NULL;
	}
}

//=============================================================================
// 更新処理
//=============================================================================
void CDebugProc::Update(void)
{

}

//=============================================================================
//	デバッグ表示の描画処理
//=============================================================================
void CDebugProc::Draw(void)
{
	RECT rect = { 0, 0, SCREEN_WIDTH, SCREEN_HEIGHT };

	// テキストを描画
	m_pFont->DrawText(NULL, &m_aStrDebug[0], -1, &rect, DT_LEFT, D3DCOLOR_RGBA(255, 0, 0, 255));

	// デバッグ情報バッファのクリア
	memset(&m_aStrDebug[0], 0, sizeof m_aStrDebug);
}

//=============================================================================
//	デバッグ表示の情報登録処理
//=============================================================================
void CDebugProc::Print(const char* fmt, ...)
{
#ifdef _DEBUG

	char aStr[256] = {};

	// 可変長引数リストの変数を定義する
	va_list args;

	// リストに受けとった文字列を代入
	va_start(args, fmt);

	// リストからバッファへ文字列を代入
	vsprintf(&aStr[0], fmt, args);

	// 終了
	va_end(args);

	// デバッグ表示バッファに受け取った文字列を連結
	strcat(&m_aStrDebug[0], &aStr[0]);

#endif
}