//=============================================================================
//
//	デバッグ表示処理 [debugproc.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _DEBUGPROC_H_
#define _DEBUGPROC_H_

//*****************************************************************************
// インクルードヘッダー
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_TEXT			(2048)			// 文字列の最大

//*****************************************************************************
// デバッグ表示クラス
//*****************************************************************************
class CDebugProc
{
public:
	CDebugProc();
	~CDebugProc();

	static HRESULT Init(void);
	static void Uninit(void);
	static void Update(void);
	static void Draw(void);

	static void Print(const char* fmt, ...);

private:
	static LPD3DXFONT m_pFont;					// フォントへのポインタ
	static char m_aStrDebug[MAX_TEXT];			// 文字列(デバッグ情報)を格納するバッファ
};

#endif // !_DEBUGPROC_H_
