//=============================================================================
//
//	ゲーム画面クラス [game.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

//*****************************************************************************
// インクルードガード
//*****************************************************************************
#ifndef _GAME_H_
#define _GAME_H_

//*****************************************************************************
// インクルードヘッダー
//*****************************************************************************
#include "manager.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CPlayer;				// プレイヤークラス
class CObjectLoader;		// オブジェクトローダークラス
class CUI;					// UIクラス
class CScore;				// スコアクラス

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// ゲーム画面クラス
//*****************************************************************************
class CGame : public CScene
{
public:

	CGame(int nPriority = 0);
	~CGame() override;

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;

	CPlayer* GetPlayer(void) const { return m_pPlayer; } 
	CScore* GetScore(void) const { return m_pScore; }

private:
	CPlayer* m_pPlayer;					// プレイヤーへのポインタ
	CObjectLoader* m_pObjectLoader;		// オブジェクトローダーへのポインタ
	CUI* m_pTutorial;					// チュートリアルUIへのポインタ
	CScore* m_pScore;					// スコアへのポインタ
	int m_nCntTutorial;					// チュートリアルUIの消失カウント
	bool m_isPause;						// ポーズ状態
};

#endif	// !_GAME_H_