//=============================================================================
//
//	アイテムクラス [item.cpp]
//	Author : SHUMA AIZU
// 
//=============================================================================

//*****************************************************************************
// インクルードヘッダー
//*****************************************************************************
#include "item.h"
#include "manager.h"
#include "texture.h"
#include "object.h"

//=============================================================================
// 生成
//=============================================================================
CItem* CItem::Create(const D3DXVECTOR3 pos,
	const D3DXVECTOR3 rot,
	const float fRadius,
	const char* pModelFile)
{
	// 最大チェック
	if (GetNumAll() >= MAX_OBJECT)
	{// これ以上生成できなければ
		// nullptrを返し終了
		return nullptr;
	}

	// ローカル変数宣言
	CItem* pItem = nullptr;		// ポインタ保存用

	// アイテムのインスタンス生成
	pItem = new CItem;

	// 初期化処理
	pItem->Init(pos, rot, fRadius, pModelFile);

	// 生成したオブジェクトのポインタを返す
	return pItem;
}

//=============================================================================
// コンストラクタ
//=============================================================================
CItem::CItem(int nPriority) : CObjectX(nPriority)
{
	// メンバ変数クリア
	m_fRadius = 0.0f;
	m_fAngle = 0.0f;
}

//=============================================================================
// デストラクタ
//=============================================================================
CItem::~CItem()
{

}

//=============================================================================
// 初期化
//=============================================================================
HRESULT CItem::Init(void)
{
	return S_OK;
}

//=============================================================================
// 初期化
//=============================================================================
HRESULT CItem::Init(const D3DXVECTOR3 pos,
	const D3DXVECTOR3 rot,
	const float fRadius,
	const char* pModelFile)
{

	// 各種値設定
	CObjectX::Init(pos, rot, pModelFile);
	m_fRadius = fRadius;
	m_fAngle = D3DX_PI;

	SetType(TYPE::TYPE_ITEM);

	return S_OK;
}

//=============================================================================
// 終了
//=============================================================================
void CItem::Uninit(void)
{
	// 終了処理
	CObjectX::Uninit();
}

//=============================================================================
// 更新
//=============================================================================
void CItem::Update(void)
{
	// 情報取得
	D3DXVECTOR3 pos = GetPosition();
	D3DXVECTOR3 rot = GetRotation();

	// てきとうな数値加算
	m_fAngle += 0.05f;
	rot.y += -0.02f;

	// 範囲内制限
	m_fAngle = NumCirculation(m_fAngle, -D3DX_PI, D3DX_PI);
	rot.y = NumCirculation(rot.y, -D3DX_PI, D3DX_PI);

	pos.y = pos.y + sinf(m_fAngle) * 0.125f;

	// 再設定
	SetPosition(pos);
	SetRotation(rot);

	// 更新処理
	CObjectX::Update();
}

//=============================================================================
// 描画
//=============================================================================
void CItem::Draw(void)
{
	// 描画処理
	CObjectX::Draw();
}

//=============================================================================
// 入手
//=============================================================================
bool CItem::Get(void)
{
	Release();

	return true;
}