//=============================================================================
//
//	モデルパーティクルクラス [model_particle.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

//*****************************************************************************
// インクルードガード
//*****************************************************************************
#ifndef _MODEL_PARTICLE_H_
#define _MODEL_PARTICLE_H_

//*****************************************************************************
// インクルードヘッダー
//*****************************************************************************
#include "object.h"
#include <vector>

//*****************************************************************************
// 前方宣言の定義
//*****************************************************************************
class CMoveModel;

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// バッチ描画エフェクトクラスの定義
//*****************************************************************************
class CModelParticle : public CObject
{
public:
	//*************************************************************************
	// 種類
	//*************************************************************************
	enum class TYPE
	{
		TYPE_SNOWFLAKE,		// 
		TYPE_STAR,
		TYPE_EARTH,
		TYPE_MAX			// 総数
	};

	static CModelParticle* Create(const D3DXVECTOR3 pos, const TYPE type);

	CModelParticle();
	~CModelParticle();

	HRESULT Init(void) override;
	HRESULT Init(const D3DXVECTOR3 pos, const TYPE type);
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;

private:
	D3DXMATRIX m_mtxWorld;					// ワールドマトリックス
	std::vector<CMoveModel*> m_vModel;		// 移動モデル
	D3DXVECTOR3 m_pos;						// 位置
	D3DXVECTOR3 m_rot;						// 向き
	D3DXCOLOR m_col;						// 色
	TYPE m_type;							// 種類
	int m_nLife;							// 寿命
};

#endif