//=============================================================================
//
//	モーションクラス [motion.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _MOTION_H_
#define _MOTION_H_

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CModel;			// モデルクラス

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_KEY				(16)	// キーの最大数
#define MAX_MOTION			(16)	// モーションの最大数
#define MAX_MODELPART		(32)	// モデルの最大数

//*****************************************************************************
// モーションクラスの定義
//*****************************************************************************
class CMotion
{
public:
	CMotion();
	~CMotion();

	//*************************************************************************
	// キーの要素の構造体定義
	//*************************************************************************
	typedef struct KEY
	{
		float fPosX;	// 位置X...親からのオフセット
		float fPosY;	// 位置Y...親からのオフセット
		float fPosZ;	// 位置Z...親からのオフセット
		float fRotX;	// 向きX
		float fRotY;	// 向きY
		float fRotZ;	// 向きZ
	}KEY;

	//*************************************************************************
	// キー情報の構造体定義
	//*************************************************************************
	typedef struct KEY_INFO
	{
		int nFrame;					// 再生フレーム(何フレームかけてモーションが遷移していくのか)
		KEY aKey[MAX_MODELPART];	// 各パーツごとのキー要素
	}KEYINFO;

	//*************************************************************************
	// モーション情報の構造体定義
	//*************************************************************************
	typedef struct INFO
	{
		bool isLoop;						// ループするかどうか[0...ループなし / 1...ループあり]
		int nNumKey;						// キーの総数
		KEY_INFO aKeyInfo[MAX_KEY];			// キー情報
	}INFO;

	void SetInfo(INFO info);
	void SetModel(CModel** ppModel, int nNumModel);

	void Set(int nType, bool isBrend);
	void Update(void);
	int GetType(void);
	bool IsFinish(void);

private:
	INFO m_aInfo[MAX_MOTION];	// モーション情報
	int m_nNumAll;				// モーションの総数
	CModel** m_ppModel;			// オブジェクトの保持するモデルへのポインタ
	int m_nNumModel;			// モデルの総数
	int m_nType;				// 現在のモーションの種類
	bool m_isLoop;				// 現在のモーションのループを管理
	int m_nNumKey;				// 現在のキーの総数
	int m_nKey;					// 現在実行されているキーの番号
	int m_nCounter;				// 現在のモーションのカウンター
	bool m_isFinish;			// 現在のモーションが終了しているか
	int	m_nTypeBlend;			// ブレンドモーションの種類
	bool m_isBlend;				// ブレンドモーションするかどうか
	bool m_isLoopBlend;			// ブレンドモーションのループを管理
	int m_nNumKeyBlend;			// ブレンドモーションのキーの総数
	int m_nKeyBlend;			// ブレンドモーションの実行されているキーの番号
	int m_nCounterMotionBlend;	// ブレンドモーションのカウンター
	int m_nFrameBlend;			// ブレンドフレーム数(何フレームかけてブレンドをするか)
	int m_nCounterBlend;		// ブレンドカウンター(ブレンドフレームが何フレーム処理されているか)
};

#endif	// !_MOTION_H_