//=============================================================================
//
//	クライアントクラス [tcp_client.cpp]
//	Author : SHUMA AIZU
// 
//=============================================================================

//*****************************************************************************
// インクルードヘッダー
//*****************************************************************************
#include <stdio.h>
#include "tcp_client.h"

//=============================================================================
// コンストラクタ
//=============================================================================
CTcpClient::CTcpClient()
{
	// メンバ変数のクリア
	m_sock = INVALID_SOCKET;
	m_pIP = NULL;
	m_sPort = 0;
}

//=============================================================================
// デストラクタ
//=============================================================================
CTcpClient::~CTcpClient()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
bool CTcpClient::Init(void)
{
	// ソケットの作成
	printf("\n*---< 通信用のソケットを作成 >---*\n");
	m_sock = socket(AF_INET, SOCK_STREAM, 0);
	if (m_sock == INVALID_SOCKET)
	{// 作成に失敗したなら
		printf("\n*---< ソケットの作成に失敗しました >---*\n");
		rewind(stdin);
		(void)getchar();
		return false;
	}

	return true;
}

//=============================================================================
// 初期化処理 (サーバー接続)
//=============================================================================
bool CTcpClient::Init(SOCKET sock, char* pIP, u_short sPort)
{
	m_sock = sock;
	m_pIP = pIP;
	m_sPort = sPort;
	return true;
}

//=============================================================================
// 終了処理
//=============================================================================
void CTcpClient::Uninit(void)
{
	if (m_sock != INVALID_SOCKET)
	{// ソケットを使っていたら
		// サーバーとの接続を切断する
		closesocket(m_sock);
		m_sock = INVALID_SOCKET;
	}
}

//=============================================================================
// サーバー接続処理
//=============================================================================
bool CTcpClient::Connect(const char* pIPAddress, u_short sPortID)
{
	// 接続先を指定用変数
	struct sockaddr_in addr;
	addr.sin_family = AF_INET;
	addr.sin_port = htons(sPortID);
	addr.sin_addr.S_un.S_addr = inet_addr(pIPAddress);

	// サーバーに接続する
	if (connect(m_sock, (struct sockaddr*)&addr, sizeof(addr)) != 0)
	{// 接続できなかったなら
		printf("\n*---< 接続に失敗しました >---*\n");
		rewind(stdin);
		(void)getchar();
		return false;
	}

	return true;
}