//=============================================================================
//
//	タイトル画面クラス [title.cpp]
//	Author : SHUMA AIZU
// 
//=============================================================================

//*****************************************************************************
// インクルードヘッダー
//*****************************************************************************
#include "title.h"
#include "input.h"
#include "ui.h"
#include "sound.h"
#include "debugproc.h"

#include "object3D.h"
#include "objectX.h"
#include "fade.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//=============================================================================
// コンストラクタ (オーバーロード)
//=============================================================================
CTitle::CTitle(int nPriority) : CScene(MODE::MODE_TITLE, nPriority)
{
	// メンバ変数クリア
	m_pButtonUI = nullptr;
	m_isPressNutton = false;
	m_fSin = 0.0f;
}

//=============================================================================
// デストラクタ
//=============================================================================
CTitle::~CTitle()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CTitle::Init(void)
{
	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CTitle::Uninit(void)
{
	// 開放
	Release();
}

//=============================================================================
// 更新処理
//=============================================================================
void CTitle::Update(void)
{
	// 入力デバイス取得
	CManager* pManager = CManager::GetInstance();
	CInputKeyboard* pInputKeyboard = pManager->GetInputKeyboard();
	CInputJoypad* pInputJoypad = pManager->GetInputJoypad();

	if ((pInputKeyboard->GetTrigger(DIK_RETURN) == true ||
		pInputJoypad->GetTrigger(CInputJoypad::KEY_A) == true) &&
		pManager->GetFade()->Get() == CFade::STATE::STATE_NONE)
	{
		pManager->GetFade()->Set(MODE_GAME, COLOR_BLACK);
	}

	CDebugProc::Print("TITLE\n");
}

//=============================================================================
// 描画処理
//=============================================================================
void CTitle::Draw(void)
{
	
}